app/Http/Controllers/NewsController.php

    public function index(Request $request)
    {
    	$posts = News::all()->sortByDesc('updated_at'); //更新順に並び替え
---
select * from `news`