app/Http/Controllers/ProfileController.php

	public function index(Request $request)
	{
		$posts = Profile::all()->sortByDesc('updated_at');
---
select * from `profiles`