app/Http/Controllers/Admin/NewsController.php

  public function create(Request $request)
  {
    $this->validate($request, News::$rules);
    $news = new News;
    $form = $request->all();

    if(isset($form['image'])){
      $path = $request->file('image')->store('public/image');
      $news->image_path = basename($path);
    }  //画像が送られてきたら、$news->image_pathに画像を保存する
    else{
      $news->image_path = null;
    }
    unset($form['_token']);
    unset($form['image']);

    $news->fill($form); //git commit と同じようなもの
    $news->save();      //git push と同じようなもの
---
insert into `news` (`image_path`, `title`, `body`, `updated_at`, `created_at`) values ('tTXA459ubw4alAy8IFVQITWmEesT6uAZ8wNaov0C.jpg', '新しく', 'あったので', '2021-03-17 16:03:17', '2021-03-17 16:03:17')

  public function index(Request $request)
  {
    $cond_title = $request->cond_title;
    if ($cond_title != '') {
      // 検索されたら検索結果を取得する
      $posts = News::where('title', $cond_title)->get();
    } else {
    // それ以外はすべてのニュースを取得する
      $posts = News::all();
---
select * from `news` where `title` = 'aaa'
select * from `news`

    public function update(Request $request)
  {
      $this->validate($request, News::$rules);
        $news = News::find($request->id);
        $news_form = $request->all();
        if ($request->remove == 'true') {
            $news_form['image_path'] = null;
        } elseif ($request->file('image')) {
            $path = $request->file('image')->store('public/image');
            $news_form['image_path'] = basename($path);
        } else {
            $news_form['image_path'] = $news->image_path;
        }

        unset($news_form['_token']);
        unset($news_form['image']);
        unset($news_form['remove']);
        $news->fill($news_form)->save();

        $history = new History;
        $history->news_id = $news->id;
        $history->edited_at = Carbon::now();
        //日付をつける
        $history->save();
---
update `news` set `image_path` = '', `news`.`updated_at` = '2021-03-26 13:31:31' where `id` = 5
insert into `histories` (`news_id`, `edited_at`, `updated_at`, `created_at`) values (5, '2021-03-26 13:31:31', '2021-03-26 13:31:31', '2021-03-26 13:31:31')

  public function delete(Request $request)
  {
    $news = News::find($request -> id);
    $news->delete();
---
delete from `news` where `id` = 7