app/Http/Controllers/Admin/ProfileController.php

  public function index(Request $request)
  {
    $cond_title = $request->cond_title;
    if ($cond_title != '') {
      // 検索されたら検索結果を取得する
      $users = Profile::where('name', $cond_title)->get();
    } else {
    // それ以外はすべての自己紹介文を取得する
      $users = Profile::all();
---
select * from `profiles` where `name` = 'Kato'
select * from `profiles`

   public function update(Request $request)
  {
      // Validationをかける
      $this->validate($request, profile::$rules);
      // News Modelからデータを取得する
      $news = profile::find($request->id);
      // 送信されてきたフォームデータを格納する
      $news_form = $request->all();
      unset($news_form['_token']);
      // 該当するデータを上書きして保存する
      $news->fill($news_form)->save();
      $test_1 = "WBS";  //withテスト

      $background = new Background; //Backgroundのデータを$backgroundに代入
      $background->profile_id = $news->id; //backgroundのprofile_idをnewsのidと同じにする
      $background->edited_at = Carbon::now(); //updateが行われた時の時間を表示する
      $background->save(); //updateが行われたときbackgroundを保存する
---
update `profiles` set `gender` = '不明', `hobby` = '不明', `introduction` = 'フフフ不明', `profiles`.`updated_at` = '2021-04-02 07:58:05' where `id` = 4
insert into `backgrounds` (`profile_id`, `edited_at`, `updated_at`, `created_at`) values (4, '2021-04-02 07:58:05', '2021-04-02 07:58:05', '2021-04-02 07:58:05')